export const getMetaTitle = (title?: string) => {
  return title ? `${title} | Amanogawa` : 'Amanogawa';
};

export const metaTexts = {
  global: {
    title: 'Amanogawa – Українська аніме-спільнота, аніме українською',
    description:
      "Спільнота Аманоґава – ми перекладаємо та озвучуємо аніме, збираємо інформацію та новини про аніме та Японію, висвітлюємо різноманітні анімешні та пов'язані з ними події в Україні та за її межами, прагнемо просувати ліцензійну манґу та манхву і ще робимо купу-купу всього іншого, до чого можемо дотягнутися і до чого маємо натхнення",
    shortTitle: 'Amanogawa',
    keywords: [
      'Amanogawa',
      'Аманоґава',
      'anime',
      'аніме',
      'аніме українською',
      'переклад аніме',
      'озвучення аніме',
      'новини про аніме',
      'аніме-фільми',
      'аніме-серіали',
    ],
  },
  anime: 'Аніме',
  login: 'Авторизація',
  signup: 'Реєстрація',
};
